Repository: tarosky/taro-nickname-for-woo
Catalog: languages/taro-nickname-*.po
Languages: es_mx, ja

source: Nick Name
es_mx: Nombre a mostrar
ja: ニックネーム

source: Nick name is required.
es_mx: Nombre a mostrar es requerido.
ja: ニックネームは必須です。

source: Auto Generate: %1$s %2$s
es_mx: Auto Generar: %1$s %2$s
ja: 自動生成: %1$s %2$s

source: Add nickname input field for user.
es_mx: Agregar campo nombre a mostrar para usuario.
ja: ニックネーム入力フィールドをユーザーに表示

source: First Name
es_mx: Nombre
ja: 姓

source: Last Name
es_mx: Apellido
ja: 名

source: Keep WooCommerce default behavior
es_mx: Mantener el comportamiento por defecto de WooCommerce
ja: WooCommerceのデフォルト動作のままにする

source: Display Name
es_mx: Nombre a Mostrar
ja: 表示名

source: By default, WooCommerce generate display name and keep it. You can change it's behavior with this option.
ja: デフォルトのままだと、WooCommerceが表示名を生成し、変更することはできません。このオプションから挙動を変更することができます。

source: Taro Nickname for Woo requires PHP 5.4 and over, but your version is %s.
es_mx: Taro Nickname for Woo requiere PHP 5.4 y superior, pero tu version es %s.
ja: Taro Nickname for Woo は PHP 5.4 以上必須ですが、あなたのバージョンは %s です。

source: Taro Nickname for Woo requires WooCommerce 3.0 and over.
es_mx: Taro Nickname for Woo requiere WooCommerce 3.0 y superior.
ja: Taro Nickname for Woo は WooCommerce 3.0 以上が必須です。

source: Add nickname field for WooCommerce.
es_mx: Agrega un campo nombre a mostrar para WooCommerce.
ja: WooCommerce にニックネーム入力フィールドを追加します。

source: TAROSKY INC.
ja: タロスカイ株式会社

source: By default, WooCommerce generate display name and keep it. You can change this behavior with this option.
es_mx: Por defecto, WooCommerce genera un nombre a mostrar y lo guarda. Puedes cambiareste comportamiento con esta opcion.
